In [6]:
import pandas as pd
import numpy as np
from datetime import datetime
import time

import matplotlib.pyplot as plt
import seaborn as sns
from sys import getsizeof as get

In [7]:
#pd.show_versions()

In [8]:

M1 = pd.read_csv(r"C:\Users\samin\Desktop\Homework2\Data\yellow_tripdata_2018-01.csv", encoding = 'latin-1')
#M1 = pd.read_csv(r"C:\Users\samin\Desktop\Homework2\Data\yellow_tripdata_2018-02.csv", encoding = 'latin-1')
#M1 = pd.read_csv(r"C:\Users\samin\Desktop\Homework2\Data\yellow_tripdata_2018-03.csv", encoding = 'latin-1')
#M1 = pd.read_csv(r"C:\Users\samin\Desktop\Homework2\Data\yellow_tripdata_2018-04.csv", encoding = 'latin-1')
#M1 = pd.read_csv(r"C:\Users\samin\Desktop\Homework2\Data\yellow_tripdata_2018-05.csv", encoding = 'latin-1')
#M1 = pd.read_csv(r"C:\Users\samin\Desktop\Homework2\Data\yellow_tripdata_2018-06.csv", encoding = 'latin-1')

In [9]:
#size of our data frame
get(M1)

2855719028

In [10]:
print(M1.shape)

(8759874, 17)

In [11]:
M1.head()

,VendorID,tpep_pickup_datetime,tpep_dropoff_datetime,passenger_count,trip_distance,RatecodeID,store_and_fwd_flag,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
0,1,2018-01-01 00:21:05,2018-01-01 00:24:23,1,0.5,1,N,41,24,2,4.5,0.5,0.5,0.00,0.0,0.3,5.80
1,1,2018-01-01 00:44:55,2018-01-01 01:03:05,1,2.7,1,N,239,140,2,14.0,0.5,0.5,0.00,0.0,0.3,15.30
2,1,2018-01-01 00:08:26,2018-01-01 00:14:21,2,0.8,1,N,262,141,1,6.0,0.5,0.5,1.00,0.0,0.3,8.30
3,1,2018-01-01 00:20:22,2018-01-01 00:52:51,1,10.2,1,N,140,257,2,33.5,0.5,0.5,0.00,0.0,0.3,34.80
4,1,2018-01-01 00:09:18,2018-01-01 00:27:06,2,2.5,1,N,246,239,1,12.5,0.5,0.5,2.75,0.0,0.3,16.55

In [12]:
M1.describe()

,VendorID,passenger_count,trip_distance,RatecodeID,PULocationID,DOLocationID,payment_type,fare_amount,extra,mta_tax,tip_amount,tolls_amount,improvement_surcharge,total_amount
count,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06,8.759874e+06
mean,1.560940e+00,1.606855e+00,2.804001e+00,1.039545e+00,1.644585e+02,1.627269e+02,1.310611e+00,1.224434e+01,3.246822e-01,4.975067e-01,1.818745e+00,3.026133e-01,2.996306e-01,1.549098e+01
std,4.962724e-01,1.258464e+00,6.412346e+01,4.450700e-01,6.636021e+01,7.031164e+01,4.817818e-01,1.168321e+01,4.502524e-01,4.333319e-02,2.486341e+00,1.738185e+00,1.442815e-02,1.419540e+01
min,1.000000e+00,0.000000e+00,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,-4.500000e+02,-4.469000e+01,-5.000000e-01,-8.880000e+01,-1.500000e+01,-3.000000e-01,-4.503000e+02
25%,1.000000e+00,1.000000e+00,9.100000e-01,1.000000e+00,1.160000e+02,1.130000e+02,1.000000e+00,6.000000e+00,0.000000e+00,5.000000e-01,0.000000e+00,0.000000e+00,3.000000e-01,8.300000e+00
50%,2.000000e+00,1.000000e+00,1.550000e+00,1.000000e+00,1.620000e+02,1.620000e+02,1.000000e+00,9.000000e+00,0.000000e+00,5.000000e-01,1.360000e+00,0.000000e+00,3.000000e-01,1.130000e+01
75%,2.000000e+00,2.000000e+00,2.840000e+00,1.000000e+00,2.340000e+02,2.340000e+02,2.000000e+00,1.350000e+01,5.000000e-01,5.000000e-01,2.350000e+00,0.000000e+00,3.000000e-01,1.662000e+01
max,2.000000e+00,9.000000e+00,1.894838e+05,9.900000e+01,2.650000e+02,2.650000e+02,4.000000e+00,8.016000e+03,6.000000e+01,4.549000e+01,4.417100e+02,9.507000e+02,1.000000e+00,8.016800e+03

In [13]:
M1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8759874 entries, 0 to 8759873
Data columns (total 17 columns):
VendorID                 int64
tpep_pickup_datetime     object
tpep_dropoff_datetime    object
passenger_count          int64
trip_distance            float64
RatecodeID               int64
store_and_fwd_flag       object
PULocationID             int64
DOLocationID             int64
payment_type             int64
fare_amount              float64
extra                    float64
mta_tax                  float64
tip_amount               float64
tolls_amount             float64
improvement_surcharge    float64
total_amount             float64
dtypes: float64(8), int64(6), object(3)
memory usage: 1.1+ GB

In [14]:
# ANY NAN VALUES IN THE MONTH OF JANUARY?


#is there any NaN (not a number) values in the dataframe?
#Returns a dataframe of boolena values (true/false)
#M1.isnull()

#Now find only those columns which have NaN values
#M1.isnull().any()

#one more any() will tell us if any of the above is true?
M1.isnull().any().any()

False

In [15]:
#another way to see if our dataframe has any NaN vales
M1.isnull().values.any()

False

# RQ1

In [16]:
#to answer this question, we need for columns. So, we drob the others. 
#keep tpep_pickup_datetime, tpep_dropoff_datetime, PULocationID, DOLocationID

#dropping vs keeping the ones I need?
#df.drop(columns=['', 'C'])
M2 = M1.filter(['tpep_pickup_datetime', 'PULocationID'])
#free the memory from this big object M1 is! 
del M1

In [17]:
M2.head(2)

  tpep_pickup_datetime  PULocationID
0  2018-01-01 00:21:05            41
1  2018-01-01 00:44:55           239

In [18]:
M2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8759874 entries, 0 to 8759873
Data columns (total 2 columns):
tpep_pickup_datetime    object
PULocationID            int64
dtypes: int64(1), object(1)
memory usage: 133.7+ MB

In [19]:
# we have two datetime objects. Let's convert them into usable data columns:  day, hour, minutes,..

#M2["hour"] = [t.hour for t in pd.DatetimeIndex(M2.datetime)]
#M2["day"] = [t.dayofweek for t in pd.DatetimeIndex(M2.datetime)]

M2['pickup_day'] = pd.DatetimeIndex(M2['tpep_pickup_datetime']).day
#M2['pickup_hour'] = pd.DatetimeIndex(M2['tpep_pickup_datetime']).hour

#M2['dropoff_day'] = pd.DatetimeIndex(M2['tpep_dropoff_datetime']).day
#M2['dropoff_hour'] = pd.DatetimeIndex(M2['tpep_dropoff_datetime']).hour


#M2['tpep_pickup-datetime'] = pd.to_datetime(M2['tpep_pickup_datetime'])
#M2.info()
#M2['Hour'] = M2['tpep_pickup_datetime'].apply(lambda time:time.hour)
#M2['Day'] = M2['tpep_pickup_datetime'].apply(lambda time: time.dayofweek)
#M2['Month'] = M2['tpep_pickup_datetime'].apply(lambda time: time.month)
#M2['year'] = M2['tpep_pickup_datetime'].apply(lambda time: time.year)

In [20]:
M2.head()

  tpep_pickup_datetime  PULocationID  pickup_day
0  2018-01-01 00:21:05            41           1
1  2018-01-01 00:44:55           239           1
2  2018-01-01 00:08:26           262           1
3  2018-01-01 00:20:22           140           1
4  2018-01-01 00:09:18           246           1

In [21]:
#Drop the columns we don't need anymore
M3 = M2.drop(columns = ['tpep_pickup_datetime'])

In [22]:
#Free up memory space 
del M2

In [23]:
M3.head()

   PULocationID  pickup_day
0            41           1
1           239           1
2           262           1
3           140           1
4           246           1

In [26]:
#concatenate(join/merge)M3 and taxi_zone_lookup dataframe

#read taxi_zone_lookup
borough = pd.read_csv(r"C:\Users\samin\Desktop\Homework2\taxi_zone_lookup.csv", encoding = 'latin-1')

In [27]:
borough.head(5)

   LocationID        Borough                     Zone service_zone
0           1            EWR           Newark Airport          EWR
1           2         Queens              Jamaica Bay    Boro Zone
2           3          Bronx  Allerton/Pelham Gardens    Boro Zone
3           4      Manhattan            Alphabet City  Yellow Zone
4           5  Staten Island            Arden Heights    Boro Zone

In [ ]:
borough.info()

In [ ]:
#the key column is LocationID in boroughs and (PULocationID or DOLocationID) in M3. They contain the same data: LocationIDs. 
#How to merge these two dataframes when two columns' keys are not in the same order?

result = pd.merge(M3,
                 borough[['LocationID', 'Borough']],
                 left_on='PULocationID',
                 right_on='LocationID',
                 how='inner' 
                 )
result.head()

In [ ]:
print("M3 dimensions: {}".format(M3.shape))
print("borough dimensions: {}".format(borough.shape))
print("result dimension: {}".format(result.shape))

In [ ]:
#The pickup boroughs are taken into consideration

M4 = result.drop(['LocationID'], 1)
M4.head()

In [ ]:
del result

In [ ]:
#now, we need to use groupby function. We need the frequency of taxis used in each day and for each borough seperately. 
#first we group by based on our boroughs.

M4.info()

In [ ]:
M4.groupby(['Borough']).groups.keys()

In [ ]:
len(M4.groupby(['Borough']).groups['Bronx'])

#len(M4.groupby(['Borough']).groups['unknown'])

In [ ]:
len(M4.groupby(['Borough']).groups['Brooklyn'])

In [ ]:
len(M4.groupby(['Borough']).groups['EWR'])

In [ ]:
len(M4.groupby(['Borough']).groups['Manhattan'])

In [ ]:
len(M4.groupby(['Borough']).groups['Queens'])

In [ ]:
len(M4.groupby(['Borough']).groups['Staten Island'])

In [ ]:
len(M4.groupby(['Borough']).groups['Unknown'])

In [ ]:
#

s = M4.groupby('Borough')['pickup_day'].count()

In [ ]:
borAvgs=[]
for i in range (7):
    borAvgs.append(s[i]//31)
NYAvgs=sum(borAvgs)
borAvgs.append(NYAvgs)

In [ ]:
print(borAvgs)

print(NYAvgs)

In [ ]:
columns=[]
index= ['Bronx','Brooklyn','EWR','Manhattan','queens','Staten Island','Unknow', 'NYC']
#df=pd.DataFrame(index=index, columns=columns)

In [ ]:
df

In [ ]:
df['May']=borAvgs

In [ ]:
df

### Observations
###### 1. Manhattan has the highest trafic of taxis. 
###### 2. Not much can be understood from the plot. Just the fourth day of month in each borough has a lower trafic. To understand why, we need to refer to the clalnder of NewYork city. Maybe it has been an off day and not many people have been outside. 
pickups are more heavily concentrated in Manhattan, while drop offs extend further into the outer boroughs.

In [ ]:
df_tra=df.T
df_tra

In [ ]:
df_tra.plot.bar()

In [ ]:
df_tra.plot(kind = '')

In [ ]:
df_tra2=df_tra.drop(columns = ['EWR', 'Manhattan','Unknow', 'NYC'])

In [ ]:
df_tra2.plot.line()